index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Reproducible Research Workshop</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dylan Schwilk" />
<link rel="stylesheet" href="./styles/schwilk-org.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Reproducible Research Workshop</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Setup</a>
<ul>
<li><a href="#sec-1-1">The Bash Shell</a></li>
<li><a href="#sec-1-2">Git</a></li>
<li><a href="#sec-1-3">R</a></li>
</ul>
</li>
<li><a href="#sec-2">Course Materials</a></li>
<li><a href="#sec-3">External resources</a>
<ul>
<li><a href="#sec-3-1">R and RStudio</a></li>
<li><a href="#sec-3-2">git</a></li>
<li><a href="#sec-3-3">Markdown</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
May 13, 2015 12:30-4:30 PM, Biology 405
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
The windows computers in room 405 will have software pre-installed.  If you want to bring your own laptop (recommended), please install the following software. 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">The Bash Shell</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Bash is a commonly-used shell that gives you the power to do simple tasks more quickly.
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Windows<br  /><div class="outline-text-4" id="text-1-1-1">
<p>
Install Git for Windows by download and running <a href="http://msysgit.github.io/">the installer</a> this will provide you with both Git and Bash in the Git Bash program.
</p>
</div>
</li>
<li><a id="sec-1-1-2" name="sec-1-1-2"></a>Mac OS X<br  /><div class="outline-text-4" id="text-1-1-2">
<p>
The default shell in all versions of Mac OS X is bash, so no need to install anything.  You access bash from the Terminal (found in <code>/Applications/Utilities</code>).  You may want to keep Terminal in your dock for this workshop.
</p>
</div>
</li>
<li><a id="sec-1-1-3" name="sec-1-1-3"></a>Linux<br  /><div class="outline-text-4" id="text-1-1-3">
<p>
The default shell is usually <code>bash</code>, but if your machine is set up differently you can run it by opening a terminal and typing <code>bash</code>.  There is no need to install anything.
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Git</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Git is a version control system that lets you track who made changes to what when and has options for easily updating a shared or public version of your code on <a href="https://github.com/">github.com</a>. I recommend you go ahead now and obtain a github.com account. This is not necessary, but will allow you to store your repositories on github for collaboration.
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-2-1" name="sec-1-2-1"></a>Windows<br  /><div class="outline-text-4" id="text-1-2-1">
<p>
Git should be installed on your computer as part of your Bash install (described above).
</p>
</div>
</li>
<li><a id="sec-1-2-2" name="sec-1-2-2"></a>Mac OS X<br  /><div class="outline-text-4" id="text-1-2-2">
<p>
For OS X 10.9 and higher, install Git for Mac by downloading and running <a href="http://git-scm.com/downloads">the installer</a>. After installing Git, there will not be anything in your <code>/Applications</code>,     as Git is a command line program.
</p>

<p>
For older versions of OS X (10.6-10.8) use the most recent available installer for your
OS <a href="http://sourceforge.net/projects/git-osx-installer/files/">available here</a>. Use the Leopard installer for 10.5 and the Snow Leopard installer for 10.6-10.8.
</p>
</div>
</li>
<li><a id="sec-1-2-3" name="sec-1-2-3"></a>Linux<br  /><div class="outline-text-4" id="text-1-2-3">
<p>
If Git is not already available on your machine you can try to install it via your distro's package manager. For Debian/Ubuntu run <code>sudo apt-get install git</code> and for Fedora run <code>sudo yum install git</code>.
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">R</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="http://www.r-project.org">R</a> is a programming language that is especially powerful for data exploration, visualization, and statistical analysis. To interact with R, we'll use <a href="http://www.rstudio.com/">RStudio</a>.
</p>
</div>
<ul class="org-ul"><li><a id="sec-1-3-1" name="sec-1-3-1"></a>Windows<br  /><div class="outline-text-4" id="text-1-3-1">
<p>
Install R by downloading and running <a href="http://cran.r-project.org/bin/windows/base/release.htm">this .exe file</a> <a href="http://cran.r-project.org/index.html">CRAN</a>. Also, please install the  <a href="http://www.rstudio.com/ide/download/desktop">RStudio IDE</a>.
</p>
</div>
</li>
<li><a id="sec-1-3-2" name="sec-1-3-2"></a>Mac OS X<br  /><div class="outline-text-4" id="text-1-3-2">
<p>
Install R by downloading and running <a href="http://cran.r-project.org/bin/macosx/R-latest.pkg">this .pkg file</a> <a href="http://cran.r-project.org/index.html">CRAN</a>. Also, please install the
<a href="http://www.rstudio.com/ide/download/desktop">RStudio IDE</a>.
</p>
</div>
</li>
<li><a id="sec-1-3-3" name="sec-1-3-3"></a>Linux<br  /><div class="outline-text-4" id="text-1-3-3">
<p>
You can download the binary files for your distribution from <a href="http://cran.r-project.org/index.html">CRAN</a>. Or
you can use your package manager (e.g. for Debian/Ubuntu     run <code>sudo apt-get install r-base</code> and for Fedora run <code>sudo yum install R</code>.  Also, please install the <i>RStudio IDE</i>.
</p>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Course Materials</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Etherpad: we'll use this etherpad to share notes and code: <a href="https://etherpad.mozilla.org/2015-05-13-rr-workshop">https://etherpad.mozilla.org/2015-05-13-rr-workshop</a>
</li>
<li><a href="lectures/reproducible-research-workshop.html">Lecture notes</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">External resources</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">R and RStudio</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="http://www.rstudio.com/">RStudio</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">git</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://try.github.io">GitHub learn git tutorial</a>
</li>
<li><a href="http://library.ttu.edu/lynda/">TTU lynda.com git tutorial</a>
</li>
<li><a href="http://blogs.biomedcentral.com/bmcblog/2013/02/28/version-control-for-scientific-research/">BioMed Central post on using verison control in science</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Markdown</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="http://pandoc.org/">pandoc</a>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div id="back-to-top">
<a href="#top">Back to top</a> | <a href="mailto:dylan.schwilk@ttu.edu">E-mail Schwilk</a>
</div>
</div>
</body>
</html>
